/*======================================================================================//
*  ・弾処理のヘッダー
*
//======================================================================================*/
#pragma once

//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"

//****************************************************************************
//　マクロ
//****************************************************************************
#define BULLET_MAX     20  //弾の最大生成数

//****************************************************************************
//　構造体
//****************************************************************************
struct BULLET
{ // プレイヤー情報
	vec2 pos;     // 座標情報
	vec2 posOld;  // 座標履歴
	vec2 speed;   // 移動量
	float angle;  // 方向
	bool use;     // 使用状況

};

// プロトタイプ宣言
void InitializeBullet();   // 弾の初期化
void FinalizeBullet();     // 弾の終了処理
void UpdateBullet();       // 弾の更新
void DrawBullet();         // 弾の描画

void CreateBullet(vec2, float,float,float); // 弾の作成


// これを敵のファイルに送り、当たり判定の処理をする。
// 弾一個に対して、敵全体に当たったかどうか(同じ座標にいるか)の処理を行い
// かぶってたら敵を消す
// この書き方をすることによって、メモリに直接書き込むため
// 
BULLET* GetBullet(void);

// 弾消去関数
void RemoveBullet(int);

