/*======================================================================================//
*  ・計算処理関数を書くためのヘッダー
*
//======================================================================================*/
#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"

//****************************************************************************
//　構造体
//****************************************************************************
struct CALCOBJECT
{ // ワイヤー処理で使用する構造体
	vec2 dif;            // 差分距離情報
	vec2 playPos;        // オブジェクト座標情報
	vec2 playOldPos;     // オブジェクト座標情報履歴
	vec2 st;             // 1ステップごとの進む量
	vec2 oldSt;          // 履歴
	vec2 wireStartPos;
	float length;        // 距離情報
	float currentLength; // どこまで生成しているか
};


// プロトタイプ宣言
void CalcPosition(int);					  // オブジェクトの位置を計算、ワイヤーの表示タイプを返す関数
bool CheckField(vec2, vec2, float );      // ワイヤーの経路上に床があるかどうか
bool CheckMoveField(vec2, vec2, float);   // ワイヤーの経路上に床があるかどうか
bool LocationConf(int);				      // プレイヤーの位置がワイヤーオブジェクトの範囲内かどうか

// 計算した座標等をポインタで渡す
CALCOBJECT* GetCalcPos();

