/*======================================================================================//
*  ・カメラ制御するためのヘッダー
*
//======================================================================================*/
#pragma once

//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"

//****************************************************************************
//　マクロ
//****************************************************************************
// 描画処理の作ったらワンちゃんそっちでもよか

#define SCROLL_MARGIN_X 40
#define SCROLL_MARGIN_Y 20

#define MAP_WIDTH 200
#define MAP_HEIGHT 25

//****************************************************************************
//　構造体
//****************************************************************************
struct CAMERA
{ // カメラ情報
	vec2 cameraPos;    // カメラの座標
	vec2 cameraOldPos; // カメラの座標履歴

};

struct BUF
{ // バッファの表示制御
	char moji;          // 表示するテキストを格納
	char color;         // 表示色が何色か格納
	//bool isUseBgColor;  // 背景色を変更するかどうかのフラグ
	//char backColor;     // 背景色
};

//****************************************************************************
//　グローバル変数
//****************************************************************************
extern BUF g_setTitleBuff[SCREEN_BOTTOM][SCREEN_RIGHT];
extern BUF g_buffTitleDraw[SCREEN_BOTTOM][SCREEN_RIGHT];

//*************************************
// プロトタイプ宣言
//*************************************
void InitializeBuffer();                        // バッファの初期化
void InitializeCamera();                        // カメラの初期化
void WriteBuffer(int, int, const char,char);    // 書き込み
void UpdateCamera();                            // カメラの更新
void DrawBuffer();                              // バッファの表示
void BuffReset();
CAMERA* GetCamera();                            // カメラ情報をポインタで渡す