#pragma once
#include "define.h"
//*****************************************************************************
// マクロ定義・定数
//*****************************************************************************
#define		EXPLOSION_MAX	(5)		//爆発の最大出現数
//*************************************
// 爆発オブジェクト 構造体
//*************************************
struct EXPLOSION	//爆発オブジェクトオブジェクト
{
	bool	use;			// 使用中フラグ
	int	type;				// タイプ
	vec2	pos;			// 座標
	float anime;		// アニメーション
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitializeExplosion();		// 爆発の初期化
void FinalizeExplosion();			// 爆発の終了処理
void UpdateExplosion();				// 爆発の更新
void DrawExplosion();					// 爆発の描画

void CreateExplosion(vec2, int);// 爆発の作成

