/*======================================================================================//
*  ・消える床の処理用のヘッダー
*
//======================================================================================*/
#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"
//****************************************************************************
//　マクロ
//****************************************************************************
#define FIELD_DIS_MAX 10

//****************************************************************************
//　構造体
//****************************************************************************
struct FIELDDIS
{
	vec2 pos;			// 座標情報
	vec2 posOld;		// 座標履歴
	size scl;			// サイズ
	//float width;		// 幅
	//float height;		// 高さ
	bool bUse;			// 有効かどうか
	int timer;          // 時間
	bool isActive;      // 出現しているかどうか
	int activeTime;     // 出現時間
	int inactiveTime;   // 消えている時間
};

//****************************************************************************
//　グローバル変数
//****************************************************************************


// プロトタイプ宣言
void InitializeFieldDis(int);   // ゲームタイトルの初期化
void FinalizeFieldDis();     // ゲームタイトルの終了処理
void UpdateFieldDis();       // ゲームタイトルの更新
void DrawFieldDis();         // ゲームタイトルの描画
void CreateDisField(vec2, size,int, int);
void RenderDisField(vec2, size);
void RemoveDisField(int);
FIELDDIS* GetDisField();
void ReDrawDisFeild();

