/*======================================================================================//
*  ・ゴール制御するためのヘッダー
*
//======================================================================================*/
#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"

//****************************************************************************
//　マクロ
//****************************************************************************
#define GOAL_MAX	(5)	//ゴールの最大数

//****************************************************************************
//　構造体
//****************************************************************************
struct GOALOBJECT
{ // オブジェクト
	vec2 pos;			// 座標情報
	vec2 posOld;		// 座標履歴
	size scl;			// サイズ
	//float width;		// 幅
	//float height;		// 高さ
	bool use;			// 有効かどうか
};


//*************************************
// プロトタイプ宣言
//*************************************

void InitializGoalObject(int);             // オブジェクト初期化
void FinalizeGoalObject();              // オブジェクト終了処理
void UpdateGoalObject();                // オブジェクト更新
void DrawGoalObject();                  // オブジェクト描画
void CreateGoalObject(vec2, size);		// オブジェクト生成
void RenderGoalObject(vec2, size);      // オブジェクト矩形描画

GOALOBJECT* GetGoalObjectPos();         // ゴールオブジェクトの座標をポインタで渡す

void RemoveGoal(int);			// 障害物の消去
void ReDrawGoal();             // 再描画