#pragma once
#include "define.h"
//*****************************************************************************
// マクロ定義・定数
//*****************************************************************************
#define		ITEM_MAX	(5)		//同時に作成出来るアイテムの数
enum	ITEMNAME	//ゲーム内で使うアイテムの種類
{
	ITEM_KINOKO,
	ITEM_HANA,
	ITEM_STAR,

	ITEM_NUM,	// アイテムの種類数
};
//*************************************
// アイテム 構造体
//*************************************
struct ITEM
{
	bool use;
	int type;
	vec2 pos;
	vec2 posOld;
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitializeItem();		// アイテムの初期化
void FinalizeItem();			// アイテムの終了処理
void UpdateItem();				// アイテムの更新
void DrawItem();					// アイテムの描画
void CreateItem(vec2, int);// アイテムの作成
void RemoveItem(int);			// アイテムの作成
ITEM* GetItem();					// アイテムの構造体 ゲッター
ITEM* GetItemSelect(int);		// アイテムの構造体 ゲッター
