/*======================================================================================//
*  ・マップカウント描画の為のヘッダー
*
*
//======================================================================================*/

#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************


// プロトタイプ宣言
void InitializeMapCount();				// マップカウントの初期化
void FinalizeMapCount();			// マップカウントの終了処理
void UpdateMapCount();				// マップカウントの更新
void DrawMapCount();				// マップカウントの描画