/*======================================================================================//
*  ・マウス入力等の情報取得は別のファイルで行っているため、その他の処理を行うために必要なものを
* 　　宣言等行う
*
*
//======================================================================================*/

#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"

//****************************************************************************
//　構造体
//****************************************************************************
struct MOUSE
{ // プレイヤー情報
	vec2 pos;     // 座標情報
	vec2 posOld;  // 座標履歴
	// vec2 speed;   // 移動量
	// float angle;  // 方向
};


// プロトタイプ宣言
void InitializePointer();   // ワイヤーの初期化
void FinalizePointer();     // ワイヤーの終了処理
void UpdatePointer();       // ワイヤーの更新
void DrowPointer();         // ワイヤーの描画
bool MousePointer(int);     // ポインターの取得
bool StartPointer();        // マウス座標取得
bool SavePointer();         // マウス座標取得
bool ExitPointer();         // マウス座標取得
bool ResultExit();
bool TitlePointer();
bool PlayPointer();
bool BackPointer();