/*======================================================================================//
*  ・動く床を生成するための処理
*
//======================================================================================*/

//****************************************************************************
//　インクルードファイル
//****************************************************************************
#pragma once
#include "define.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define FIELD_MOVE_MAX	(40)	//障害物の最大数
//*************************************
// 障害物 構造体
//*************************************
struct MOVEFIELD
{
	vec2 pos;			// 座標情報
	vec2 posOld;		// 座標履歴
	size scl;			// サイズ
	//float width;		// 幅
	//float height;		// 高さ
	bool bUse;			// 有効かどうか

	// 動く床用
	bool isMoving;       // 動く床かどうか
	vec2 moveDir;        // 移動方向
	float moveSpeed;     // 移動速度
	float moveRange;     // 移動範囲
	vec2 startPos;       // 初期座標（折り返し判定用）
};
//*************************************
// プロトタイプ宣言
//*************************************
void InitializeMoveField(int);		// 障害物の初期化
void FinalizeMoveField();			// 障害物の終了処理
void UpdateMoveField();				// 障害物の更新
void DrawMoveField();					// 障害物の描画

void CreateMoveField(vec2, size, vec2, float, float);// 障害物の作成
void RenderMoveField(vec2, vec2, size);// 障害物の矩形描画

void RemoveMoveField(int);			// 障害物の消去
MOVEFIELD* GetMoveField();				// 障害物 構造体 ゲッター

void ReDrawMoveFeild();             // 再描画