/*======================================================================================//
*  ・マウス入力等の情報取得は別のファイルで行っているため、その他の処理を行うために必要なものを
* 　　宣言等行う
*
*
//======================================================================================*/
#pragma once

// =============================================================================
// プロトタイプ宣言
// =============================================================================

void InitializePause(void);	// ポーズシーンの初期化処理
void UpdatePause(void);		// ポーズシーンの更新処理
void DrawPause(void);		// ポーズシーンの描画処理
void FinalizePause(void);	// ポーズシーンの終了処理
void SetPause(bool);        // セッター
bool GetPause();            // ゲッター
void LoadPauseFile();