/*======================================================================================//
*  ・プレイヤー処理のヘッダー
*
//======================================================================================*/
#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"

//****************************************************************************
//　マクロ
//****************************************************************************
#define PLAYER_MOVE_SPEED_X (0.50f)    // X座標の移動量
#define PLAYER_MOVE_SPEED_Y (0.50f)    // Y座標の移動量

#define VALUE_JUMP          (1.00f)    // ジャンプ量
#define VALUE_RESIST_X      (0.50f)    // 地上での移動摩擦抵抗
#define VALUE_RESIST_X_AIR  (0.35f)    // 空中での移動摩擦抵抗
#define VALUE_GRAVITY       (0.04f)    // 重力量

#define PLAYER_WIRE_ACCEL 0.15f
#define PLAYER_WIRE_MAX_SPEED 1.2f

//****************************************************************************
//　構造体
//****************************************************************************
struct PLAYER
{ // プレイヤー情報
	vec2 pos;     // 座標情報
	vec2 posOld;  // 座標履歴
	vec2 speed;   // 移動量
	vec2 speedOld;// 移動量履歴
	float angle;  // 方向
	bool hit;     // 敵との衝突
	bool hitOld;  // 敵との衝突履歴
	bool jump;    // ジャンプ中かどうかのフラグ
	bool lamd;    // 地面にいるかどうかのフラグ
	bool isUseWr; // ワイヤーを使用しているかどうかのフラグ
};

// プロトタイプ宣言
PLAYER* GetPlayerPos();    // プレイヤー情報をポインタとして渡す
void InitializePlayer();   // 自機の初期化
void FinalizePlayer();     // 自機の終了処理
void UpdatePlayer();       // 自機の更新
void DrawPlayer();         // 自機の描画