/*======================================================================================//
*  ・リザルト画面のヘッダー
*
//======================================================================================*/
#pragma once

//****************************************************************************
//　マクロ
//****************************************************************************
#define TITLE_Y       17
#define TITLE_RIGHT   40
#define TITLE_LEFT    36

#define EXIT_RESULT_Y        19
#define	EXIT_RESULT_RIGHT    39
#define	EXIT_RESULT_LEFT     36

// プロトタイプ宣言
void InitializeReslut();   // ゲームリザルトの初期化
void FinalizeReslut();     // ゲームリザルトの終了処理
void UpdateReslut();       // ゲームリザルトの更新
void DrawReslut();         // ゲームリザルトの描画
void LoadResultFile();