/*======================================================================================//
*  ・タイトル画面のヘッダー
*
//======================================================================================*/
#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"
//****************************************************************************
//　マクロ
//****************************************************************************
#define MAX_READ_FILE 10

// タイトル文字の判定範囲
#define START_Y       16
#define START_RIGHT   40
#define START_LEFT    36

#define SAVE_Y        18
#define	SAVE_RIGHT    43
#define	SAVE_LEFT     36

#define EXIT_Y        20
#define	EXIT_RIGHT    39
#define	EXIT_LEFT     36
//****************************************************************************
//　構造体
//****************************************************************************
struct TITLE
{
	int loadCnt;
	int titleFileInx;   
	int titleFrameCounter; 
};
//****************************************************************************
//　グローバル変数
//****************************************************************************


// プロトタイプ宣言
void InitializeTitle();   // ゲームタイトルの初期化
void FinalizeTitle();     // ゲームタイトルの終了処理
void UpdateTitle();       // ゲームタイトルの更新
void DrawTitle();         // ゲームタイトルの描画
void LoadFile();          // ファイルの読み込み