/*======================================================================================//
*  ・ゲーム画面以外のバッファ表示用ヘッダー
*
//======================================================================================*/
#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"
//****************************************************************************
//　構造体
//****************************************************************************
struct RGB
{ // RGB情報
	int r;
	int g;
	int b;
};

struct TITLEBUF
{ // バッファの表示制御
	char moji;          // 表示するテキストを格納
	RGB color;         // 表示色が何色か格納
	RGB backColor;     // 背景色
};


//****************************************************************************
//　グローバル変数
//****************************************************************************
extern TITLEBUF g_tSetBuff[SCREEN_BOTTOM + 1][SCREEN_RIGHT + 1];
extern TITLEBUF g_tBuffDraw[SCREEN_BOTTOM + 1][SCREEN_RIGHT + 1];


// プロトタイプ宣言
void InitializeTitleBuffer();                                         // ゲームタイトルバッファの初期化
void FinalizeTitleBuffer();                                           // ゲームタイトルバッファの終了処理
void UpdateTitleBuffer();                                             // ゲームタイトルバッファの更新
void DrawTitleBuffer();                                               // ゲームタイトルバッファの描画
void WriteTitleBuffer(int, int, const char, RGB, RGB);				  // ゲームタイトルバッファの書き込み
bool IsDiff(int , int );                                              // 差分があるかどうか
void ClearTitleBuffer();