/*======================================================================================//
*  ・ワイヤー移動に使用するためのオブジェクトを生成する処理のヘッダー
*
//======================================================================================*/
#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"

//****************************************************************************
//　マクロ
//****************************************************************************
#define WIREGEN_MAX	(40)	// ワイヤーオブジェクトの最大数


//****************************************************************************
//　構造体
//****************************************************************************
struct WIREOBJECT
{ // オブジェクト
	vec2 pos;			// 座標情報
	vec2 posOld;		// 座標履歴
	size scl;			// サイズ
	vec2 posCamera;     // カメラ情報を含めた座標
	//float width;		// 幅
	//float height;		// 高さ
	bool bUse;			// 有効かどうか
};


// プロトタイプ宣言
void InitializWireObject(int);             // オブジェクト初期化
void FinalizeWireObject();              // オブジェクト終了処理
void UpdateWireObject();                // オブジェクト更新
void DrawWireObject();                  // オブジェクト描画
void CreateWireObject(vec2, size);		// オブジェクト生成
void RenderWireObject(vec2, size);      // オブジェクト矩形描画

WIREOBJECT* GetWireObjectPos();         // ワイヤーオブジェクトの座標をポインタで渡す 



