/*======================================================================================//
*  ・ワイヤーを生成するためのヘッダー
*
//======================================================================================*/
#pragma once
//****************************************************************************
//　インクルードファイル
//****************************************************************************
#include "define.h"

//****************************************************************************
//　マクロ
//****************************************************************************
#define WIRE_HIT_RANGE 0.5
//****************************************************************************
//　構造体
//****************************************************************************
struct WIREGEN
{ // ワイヤー情報
	vec2 pos;     // 座標情報
	vec2 posOld;  // 座標履歴
	// vec2 speed;   // 移動量
	// float angle;  // 方向
};

enum WIRESTATE
{
	WIRE_IDLE,
	WIRE_EXTENDING,
	WIRE_READY,
	WIRE_MOVING
};


// プロトタイプ宣言
void InitializWireGen();     // ワイヤーの初期化
void FinalizeWireGen();      // ワイヤーの終了処理
void UpdateWireGen();        // ワイヤーの更新
void DrowWireGen();          // ワイヤーの描画
void CreateWire();           // ワイヤーの生成
void ClearWire();            // ワイヤーの削除
WIRESTATE* GetWireState();   // ワイヤーの状態をポインタで渡す
void ShrinkWire();           // ワイヤーを徐々に消す（根元から縮める）
void ClearWireWithOldCamera();
void RedrawWire();